test/Sedov/SedovTestRhoCentral1cell/system/blockMeshDict

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1; // feet to meters

R   0.5;
x   #calc "$R*cos(Foam::constant::mathematical::pi/180.0)";
y   #calc "$R*sin(Foam::constant::mathematical::pi/180.0)";
ny  #calc "-$R*sin(Foam::constant::mathematical::pi/180.0)";


vertices
(
    (0 0 0)
    ($x $ny $ny)
    ($x $y  $ny)
    ($x $ny $y)
    ($x $y  $y)
);

blocks
(
    hex (0 1 2 0 0 3 4 0) (500 1 1) simpleGrading (1 1 1) // only multiply by 2
);

edges
(
);

boundary
(
    wedge0
    {
        type wedge;
        faces
        (
            (0 1 2 0)
        );
    }
    wedge1
    {
        type wedge;
        faces
        (
            (0 3 4 0)
        );
    }
    wedge2
    {
        type wedge;
        faces
        (
            (0 2 4 0)
        );
    }
    wedge3
    {
        type wedge;
        faces
        (
            (0 1 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 4 3)
        );
    }
 );

mergePatchPairs
(
);

// ************************************************************************* //
