test/Sedov/SedovTestRhoCentral1cell/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wedge0
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          500;
        startFace       499;
    }
    wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          500;
        startFace       999;
    }
    wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          500;
        startFace       1499;
    }
    wedge3
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          500;
        startFace       1999;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       2499;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       2500;
    }
)

// ************************************************************************* //
