test/Sedov/SedovTestRhoCentral1cell/constant/thermophysicalProperties_
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            myHeRhoThermo;
    mixture         myPureMixture;
    transport       const;
    thermo          eConst;
    equationOfState myPerfectGas;
    specie          mySpecie;
    energy          sensibleInternalEnergy;
}

mixture
{
    mySpecie
    {
        molWeight       28.96;
    }
    
    equationOfState
    {
        rhoCoeffs   // Quantity to be evaluated
        {
            file       "constant/rho.csv";
            mod         none;
            delim       ",";
            isReal      false;
            flipTable   false;
        }

        pCoeffs
        {
            mod         none;
            n           10;
            min         8955.29270348;
            delta       10194.96324039;
            isReal      false;
        }
        TCoeffs
        {
            mod         none;

            n           10;
            min         148.4131591;
            delta       28.33507049;
            isReal      false;
        }
    }

    thermodynamics
    {
        Cv   717.7;
        Hf   0.0;
        Tref   0.0;

        eCoeffs
        {
            file       "constant/e.csv";
            mod         none;
            delim       ",";
            isReal      false;
            flipTable   false;
        }

        CvCoeffs
        {
            file       "constant/Cv.csv";
            mod         none;
            delim       ",";
            isReal      false;
            flipTable   false;
        }

        CpCoeffs
        {
            file       "constant/Cp.csv";
            mod         none;
            delim       ",";
            isReal      false;
            flipTable   false;
        }

        cSqrCoeffs
        {
            file       "constant/cSqr.csv";
            mod         none;
            delim       ",";
            isReal      false;
            flipTable   false;
        }

        pCoeffs
        {
            mod         none;
            n           10;
            min         8955.29270348;
            delta       10194.96324039;
            isReal      false;
        }
        TCoeffs
        {
            mod         none;

            n           10;
            min         148.4131591;
            delta       28.33507049;
            isReal      false;
        }
    }
    transport
    {
        mu  0;   
        Pr  1;
    }
}


// ************************************************************************* //
