test/Sedov/SedovTestRhoCentral1cell/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

setFormat raw;

surfaceFormat vtk;

interpolationScheme cell;

// Fields to sample.
fields
(
    p
    rho
    U
);


sets
(
    Centerline
    {
        type        cellCentre;
        axis        x;

        start       (0 0 0);
        end         (0.5 0 0);
    }
);


surfaces ();

// *********************************************************************** //
